{"pages":[],"posts":[{"title":"community-bonding","text":"Hello ! Its been quite a while since the GSoC results were announced and community bonding period commenced. The calendar says May 30 and the coding period will begin in about 10 days. So lets move on to how I actually spent the community bonding period yet and what plans do I have for the coming days before the coding period starts. Project IntroductionThe project bases its goal on creating an EHR system using the webcomponents implementing FHIR resources developed during the previous versions of GSoC. For the implementation some new resource based components will be required as well which will be created simultaneously. During GSoC 2018, under this project a polymer application was developed which combined all the web component0s (developed at that time) into a PWA. The current project will be built upon this application by adding and implementing workflows. the workflows that will be implemented in the EHR are : Check-in Visit e-Prescription Appointment Lab orders Amazing Mentor Team Saptarshi Purkayastha Namratanehete Community Bonding PeriodBackgroundDuring the application period upon the suggestions of the mentors I had decided to mainly work on the CI and the Designs of the PWA during the community bonding period. Even before the results were announced I was already experimenting with setting up the project so as to identify any problems that may occur as using lit-components inside React can be a little trouble because React never exposes the real DOM. Bonding PeriodSo as soon as the results were released I started looking on these parts. I started with the CI part first, one of the pointers in this was also to look for a cross platform - cross browser testing method (SauceLabs) suggested by my mentor. I looked at some of the possibe integrations with these automation tools here. But most of these are based on e2e testing ( cypress , Puppeteer and others ) and our main focus is on unit and integration testing which will require the react component to be mounted and tested , for which many tools are available but I could not find their integration with sauce or any cross browser-cross platform tool. Once I figure out a way for this issue the CI part will hardly take any time ! the design part:I have designed one workflow ( check-in ) and will complete the remaining in the coming 2-3 days ! adding to these I will document the endpoints that will be used in each steps in the designed workflows. The endpoints of the check-in workflow is provided below. here is the video of the designed check-in workflow: check-in.mp4 from Shashwat on Vimeo. CHECK-IN WORKFLOW :SEARCH PARAMS :GET [base]/Patient?identifier=[value] GET [base]/Patient?name=[value] CREATE PATIENT :POST [base]/Patient GET PATIENT :GET [base]/Patient/[_id] ConclusionThis week’s blog was not too long as I have not written any code, but hoping to deliver some interesting content in the upcoming weeks! I will be posting a blog every week highlighting the things I completed during the week and the things that I plan to achieve. See you next week 😄","link":"/blog/2021/05/29/community-bonding/"},{"title":"ehr_endpoints","text":"CHECK-IN WORKFLOW : Valid search parameters for this search are: [_id, _language, _lastUpdated, active, address, address-city, address-country, address-postalcode, address-state, address-use, birthdate, death-date, deceased, email, family, gender, general-practitioner, given, identifier, language, link, name, organization, phone, phonetic, telecom] SEARCH PARAMS :GET [base]/Patient?identifier=[value] GET [base]/Patient?name=[value] CREATE PATIENT :POST [base]/Patient GET PATIENT :GET [base]/Patient/[_id] EDIT PATIENT :PUT [base]/Patient/[_id] APPOINTMENT WORKFLOW : SCHEDULE TAB Valid search parameters for this search are: [_id, _language, _lastUpdated, active, actor, date, identifier, service-category, service-type, specialty] SEARCH PARAMS :GET [base]/Schedule?actor=Practitioner/[value]GET [base]/Schedule?actor=Location/[value]GET [base]/Schedule?actor=Patient/[value] GET [base]/Schedule?service-category=[value] CREATE SCHEDULE :POST [base]/Schedule GET SCHEDULE :GET [base]/Schedule/[_id] EDIT SCHEDULE :PUT [base]/Schedule/[_id] SLOT TAB Valid search parameters for this search are: [_id, _language, _lastUpdated, appointment-type, identifier, schedule, service-category, service-type, specialty, start, status] SEARCH PARAMS :GET [base]/Slot?status=[value]GET [base]/Slot?schedule=[value] CREATE SLOT :POST [base]/Slot GET SLOT :GET [base]/Slot/[_id] EDIT SLOT :PUT [base]/Slot/[_id] APPOINTMENT TAB Valid search parameters for this search are: [_id, _language, _lastUpdated, actor, appointment-type, based-on, date, identifier, location, part-status, patient, practitioner, reason-code, reason-reference, service-category, service-type, slot, specialty, status, supporting-info]&quot; SEARCH PARAMS :GET [base]/Appointment?actor=[value]GET [base]/Appointment?status=[value] CREATE APPOINTMENT :POST [base]/Appointment GET APPOINTMENT :GET [base]/Appointment/[_id] EDIT APPOINTMENT :PUT [base]/Appointment/[_id] `","link":"/blog/2021/06/02/ehr-endpoints/"}],"tags":[{"name":"GSoC21","slug":"GSoC21","link":"/blog/tags/GSoC21/"}],"categories":[{"name":"LibreHealth","slug":"LibreHealth","link":"/blog/categories/LibreHealth/"},{"name":"EHR","slug":"EHR","link":"/blog/categories/EHR/"}]}